
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>La riproducibilità della ricerca e l'analisi dei dati · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05OpenAccessToPublishedResearchResults.html" />
    
    
    <link rel="prev" href="03OpenResearchSoftwareAndOpenSource.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Readme
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../01Introduction/">
            
                <a href="../01Introduction/">
            
                    
                    Introduzione
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    I principi fondamentali della Scienza Aperta
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="01OpenConceptsAndPrinciples.html">
            
                <a href="01OpenConceptsAndPrinciples.html">
            
                    
                    Concetti e principi "open"
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="02OpenResearchDataAndMaterials.html">
            
                <a href="02OpenResearchDataAndMaterials.html">
            
                    
                    Dati di ricerca e materiali aperti
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="03OpenResearchSoftwareAndOpenSource.html">
            
                <a href="03OpenResearchSoftwareAndOpenSource.html">
            
                    
                    Software aperto per la ricerca e open source
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="04ReproducibleResearchAndDataAnalysis.html">
            
                <a href="04ReproducibleResearchAndDataAnalysis.html">
            
                    
                    La riproducibilità della ricerca e l'analisi dei dati
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="05OpenAccessToPublishedResearchResults.html">
            
                <a href="05OpenAccessToPublishedResearchResults.html">
            
                    
                    Accesso aperto ai risultati della ricerca pubblicati
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="06OpenLicensingAndFileFormats.html">
            
                <a href="06OpenLicensingAndFileFormats.html">
            
                    
                    Licenze e formato dei file
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="07CollaborativePlatforms.html">
            
                <a href="07CollaborativePlatforms.html">
            
                    
                    Le piattaforme collaborative
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="08OpenPeerReviewMetricsAndEvaluation.html">
            
                <a href="08OpenPeerReviewMetricsAndEvaluation.html">
            
                    
                    Revisione tra pari aperta, metriche e valutazione
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="09OpenSciencePolicies.html">
            
                <a href="09OpenSciencePolicies.html">
            
                    
                    Politiche e Scienza Aperta
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="10CitizenScience.html">
            
                <a href="10CitizenScience.html">
            
                    
                    Citizen Science - la scienza di tutti
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="11OpenEducationalResources.html">
            
                <a href="11OpenEducationalResources.html">
            
                    
                    Risorse aperte per l'insegnamento e l'apprendimento
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="12OpenAdvocacy.html">
            
                <a href="12OpenAdvocacy.html">
            
                    
                    L'advocacy aperta
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../03OnLearningAndTraining/">
            
                <a href="../03OnLearningAndTraining/">
            
                    
                    Processi di apprendimento e di formazione
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../04OrganizationalAspects/">
            
                <a href="../04OrganizationalAspects/">
            
                    
                    Aspetti organizzativi
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../05ExamplesAndPracticalGuidance/">
            
                <a href="../05ExamplesAndPracticalGuidance/">
            
                    
                    Esempi & guida pratica: adotta, adatta, sviluppa
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../06Glossary/">
            
                <a href="../06Glossary/">
            
                    
                    Glossario
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../07References/">
            
                <a href="../07References/">
            
                    
                    Bibliografia
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../08AboutTheAuthorsAndFacilitators/">
            
                <a href="../08AboutTheAuthorsAndFacilitators/">
            
                    
                    Gli autori
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../09AboutItalianTranslatorsRevisioners/">
            
                <a href="../09AboutItalianTranslatorsRevisioners/">
            
                    
                    Traduttori e Revisori che hanno collaborato alla versione italiana del manuale
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >La riproducibilità della ricerca e l'analisi dei dati</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id=""><img src="../Images/Icons/reuse.png" width="200" height="200"> <img src="../Images/Icons/research.png" width="200" height="200"></h2>
<h2 id="4-la-riproducibilit&#xE0;-della-ricerca-e-lanalisi-dei-dati">4. La riproducibilit&#xE0; della ricerca e l&#x2019;analisi dei dati</h2>
<h3 id="di-che-cosa-si-tratta">Di che cosa si tratta?</h3>
<p>Per riproducibilit&#xE0; della ricerca si intende la possibilit&#xE0; di mettere a disposizione i dati grezzi e il codice della ricerca in modo che altri possano conseguire gli stessi risultati cos&#xEC; come sono stati presentati nelle conclusioni del lavoro di ricerca. Strettamente connesso  &#xE8; il concetto di replicabilit&#xE0; il quale consente di riprodurre una metodologia scientifica per raggiungere analoghe conclusioni. Entrambi i due concetti sono componenti cruciali della ricerca empirica. </p>
<p>Migliorare la riproducibilit&#xE0; comporta maggior rigore e qualit&#xE0; dei prodotti scientifici e di conseguenza un maggior grado di affidabilit&#xE0; della scienza. Sempre di pi&#xF9; si percepiscono il bisogno e la volont&#xE0; di esporre il flusso della ricerca, dal momento cio&#xE8; in cui un progetto inizia, passando per la raccolta dei dati fino all&#x2019;interpretazione e alla presentazione dei risultati. Tali sviluppi implicano naturalmente delle sfide inclusa la creazione di flussi di lavoro integrati della ricerca che possono essere adottati dai collaboratori mantenendo al tempo stesso standard di integrit&#xE0; molto elevati. </p>
<p>Il concetto di riproducibilit&#xE0; &#xE8; direttamente applicabile al metodo scientifico, cardine della scienza, e in particolare attraverso le seguenti cinque fasi:</p>
<ol>
<li><p>Formulazione di un&#x2019;ipotesi</p>
</li>
<li><p>Pianificazione dello studio</p>
</li>
<li><p>Conduzione dello studio e raccolta dei dati</p>
</li>
<li><p>Analisi dei dati</p>
</li>
<li><p>Presentazione dei risultati dello studio</p>
</li>
</ol>
<p>Per ognuna di queste fasi si dovrebbe riuscire a produrre una documentazione chiara e aperta in modo da rendere lo studio trasparente e riproducibile. </p>
<p><img src="../Images/02%20Open%20Science%20Basics/02_reproducible_research_data_analysis.png" alt=""></p>
<h3 id="fondamenti">Fondamenti</h3>
<p>Alcuni fattori generali possono contribuire ulteriormente alla causa della non-riproducibilit&#xE0; ma possono anche condurre all&#x2019;adozione di misure specifiche che rispondono direttamente a queste cause. La cultura e l&#x2019;ambiente in cui la ricerca ha luogo &#xE8; un importante fattore generale, dall&#x2019;alto verso il basso. Da una prospettiva &#x201C;dal basso verso l&#x2019;alto&#x201D;, l&#x2019;educazione continua e la formazione per ricercatori pu&#xF2; far accrescere la consapevolezza nonch&#xE9; la divulgazione di buone prassi. </p>
<p>Se da una parte &#xE8; importante capire l&#x2019;ampia gamma di fattori che contribuiscono alla riproducibilit&#xE0;, &#xE8; per&#xF2; altrettanto difficile scomporre questi fattori in fasi che possono essere adottate immediatamente in un programma di ricerca esistente e migliorare immediatamente la sua riproducibilit&#xE0;. Uno dei primi passi &#xE8; determinare lo stato dell&#x2019;arte corrente e tenerne costantemente monitorato il miglioramento dato che per aumentare sempre di pi&#xF9; la riproducibilit&#xE0; vengono prese in continuazione nuove misure. Alcune delle problematiche pi&#xF9; comuni in merito alla riproducibilit&#xE0; della ricerca sono illustrate nella figura sottostante:</p>
<p><img src="../Images/image_2.png" alt=""></p>
<p>Fonte: Symposium report, October 2015. Reproducibility and reliability of biomedical research: improving research practice <a href="https://acmedsci.ac.uk/viewFile/56314e40aac61.pdf" target="_blank">PDF</a>.</p>
<p><a href="https://doi.org/10/gc5sjs" target="_blank">Goodman, Fanelli, &amp; Ioannidis (2016)</a> evidenziano come in epidemiologia, biologia computazionale, economia e sperimentazione clinica, per riproducibilit&#xE0; si intende spesso</p>
<p><em>&#x201C;l&#x2019;abilit&#xE0; di un ricercatore di duplicare i risultati di uno studio precedente utilizzando gli stessi materiali utilizzati dal primo ricercatore. In questo modo, il secondo ricercatore pu&#xF2; utilizzare gli stessi dati grezzi e ricostruire le stesse analisi e utilizzare la stessa analisi statistica nel tentativo di ottenere gli stessi risultati&#x201D;.</em></p>
<p>Si tratta di qualcosa di diverso dalla replicabilit&#xE0;: <em>&#x201C;che si riferisce all&#x2019;abilit&#xE0; di un ricercatore di duplicare i risultati di uno studio precedente se segue le stesse procedure ma raccoglie nuovi dati&#x201D;</em>. Per semplicit&#xE0; si pu&#xF2; pensare che la riproducibilit&#xE0; &#xE8; orientata al metodo mentre la replicabilit&#xE0; &#xE8; orientata al risultato. </p>
<p>La riproducibilit&#xE0; pu&#xF2; essere valutata su diversi livelli: a livello di progetto individuale (ad esempio di articolo, sperimentazione, metodo o set di dati), a livello di ricercatore individuale, laboratorio o gruppo di ricerca, istituzione o perfino ambito di ricerca. Per ciascuno di questi diversi livelli possono essere applicati criteri o punteggi di valutazione leggermente diversi. Ad esempio, un&#x2019;istituzione sostiene le pratiche di riproducibilit&#xE0; se introduce delle politiche con le quali finanzia/premia il ricercatore che fa scienza riproducibile. D&#x2019;altro canto, un ambito di ricerca pu&#xF2; essere considerato avere un maggiore o minore livello di riproducibilit&#xE0; se sviluppa risorse -della cui manutenzione si occupa la comunit&#xE0;- che promuovono e facilitano delle pratiche di ricerca riproducibile, come archivi di dati o standard di condivisione dei dati comuni. </p>
<h2 id=""><img src="../Images/Icons/finish.png" width="150" height="150"></h2>
<h3 id="finalit&#xE0;-didattiche">Finalit&#xE0; didattiche</h3>
<p>Sono tre gli obiettivi principali che &#xE8; necessario menzionare in questa sede:</p>
<ol>
<li><p>Comprendere quanto sia importante creare ricerca riproducibile.</p>
</li>
<li><p>Comprendere in generale il sistema della ricerca riproducibile (compresa la progettazione del flusso di lavoro, la gestione dei dati e una reportistica dinamica).</p>
</li>
<li><p>Conoscere i singoli passaggi che compongono il processo di riproducibilit&#xE0; nonch&#xE8; le risorse corrispondenti che possono essere impiegate. </p>
</li>
</ol>
<h3 id="componenti-chiave">Componenti chiave</h3>
<h2 id=""><img src="../Images/Icons/brain.png" width="150" height="150"></h2>
<h4 id="conoscenza">Conoscenza</h4>
<p>L&#x2019;elenco che segue contiene i punti che indicativamente si devono tenere presente quando si parla di riproducibilit&#xE0;:   </p>
<ul>
<li><p>Che cos&#x2019;&#xE8; la &#x201C;crisi della riproducibilit&#xE0;&#x201D; e la meta-analisi della riproducibilit&#xE0;</p>
</li>
<li><p>I principi della riproducibilit&#xE0;, dell&#x2019;integrit&#xE0; e dell&#x2019;etica nella ricerca</p>
</li>
<li><p>Quali sono le opzioni computazionali e i contesti che permettono un assetto collaborativo e riproducibile </p>
</li>
<li><p>I fattori che influenzano la riproducibilit&#xE0; della ricerca</p>
</li>
<li><p>Documentazione sull&#x2019;analisi dei dati e dei flussi della ricerca aperta</p>
</li>
<li><p>Ambienti di analisi riproducibili (virtualizzazione)</p>
</li>
<li><p>Riferimento alla &quot;Researcher Degrees of Freedom&quot; (<a href="https://doi.org/10/gc5sjn" target="_blank">Wicherts et al., 2016</a>).</p>
</li>
</ul>
<h2 id=""><img src="../Images/Icons/gears.png" width="150" height="150"></h2>
<h4 id="competenze">Competenze</h4>
<p>Ci sono alcuni consigli pratici in materia di riproducibilit&#xE0; a cui tutti dovrebbero fare riferimento nel momento in cui si definiscono le particolari competenze necessarie per poterla garantire. In generale, le prassi migliori in materia di riproducibilit&#xE0; possono essere prese in prestito dalle pratiche della Scienza Aperta ma la loro integrazione offre dei vantaggi agli stessi singoli ricercatori sia che scelgano di condividere la loro ricerca oppure no. La ragione per cui integrare le prassi migliori di riproducibilit&#xE0; sia un vantaggio per il singolo ricercatore &#xE8; che queste migliorano la pianificazione, l&#x2019;organizzazione e la documentazione della ricerca. Di seguito, ecco un esempio di come si possa tradurre in pratica il concetto di riproducibilit&#xE0; nel flusso della ricerca con rimandi alle pratiche contenute in questo manuale. </p>
<h2 id=""><img src="../Images/Icons/task.png" width="150" height="150"></h2>
<h5 id="1-la-riproducibilit&#xE0;-si-pianifica-prima-di-iniziare"><strong>1. La riproducibilit&#xE0; si pianifica prima di iniziare</strong></h5>
<h6 id="create-un-piano-o-protocollo-di-studio">Create un piano o protocollo di studio</h6>
<p>Iniziate a tenere la documentazione di ricerca fin dall&#x2019;inizio del vostro studio predisponendo un piano o protocollo di studio che includa struttura e metodi dello studio proposto. Laddove opportuno, utilizzate le linee guida per la reportistica contenute in <a href="http://www.equator-network.org/" target="_blank">Equator Network</a>. Tenete traccia di tutte le variazioni al piano o protocollo di lavoro utilizzando strumenti per il controllo versione (rif. controllo versione). Calcolate la potenza o le dimensioni del campione e riportate queste informazioni nel protocollo poich&#xE9; gli studi sottodimensionati tendono alla non-riproducibilit&#xE0;. </p>
<h6 id="scegliete-strumenti-e-materiali-riproducibili">Scegliete strumenti e materiali riproducibili</h6>
<p>Selezionate degli anticorpi che funzionano utilizzando un motore di ricerca anticorpi come <a href="https://www.citeab.com/" target="_blank">CiteAb</a>. Per non cadere nella non-riproducibilit&#xE0; utilizzando delle linee cellulari vaghe, scegliete quelle autenticate da  <a href="http://iclac.org/" target="_blank">International Cell Line Authentication Committee</a>. Laddove sia possibile, scegliete degli strumenti di hardware e di software di cui detenete i diritti e che vi permettano di migrare la vostra ricerca fuori dalla piattaforma per essere riutilizzata. (rif. Software di ricerca aperti e codice aperto).</p>
<h6 id="pianificate-un-progetto-riproducibile">Pianificate un progetto riproducibile</h6>
<p>Accentrate e organizzate la gestione del progetto utilizzando una piattaforma elettronica, un archivio o cartelle centrali per tutti i documenti della ricerca. Potete utilizzare GitHub come luogo dove depositare tutti insieme i file o gestire il tutto utilizzando un notebook lab elettronico come <a href="https://benchling.com/" target="_blank">Benchling</a>, <a href="https://www.labguru.com/" target="_blank">Labguru</a> o <a href="https://scinote.net/" target="_blank">SciNote</a>. Nel merito del vostro progetto centralizzato, seguite le pratiche migliori separando i dati dal codice in diverse cartelle. Gestite i vostri dati grezzi in sola lettura e teneteli separati dai dati processati (rif. Gestione dei dati)</p>
<p>Quando salvate o eseguite il back up di un vostro file di ricerca, optate per dei nomi di formati o file informativi che ne permettano il ri-uso. I nomi dei file dovrebbero essere leggibili sia dalle macchine sia dalle persone (rif. Gestione dei dati). Nelle vostre analisi e codici software usate dei percorsi relativi. Evitate dei formati di file proprietari e utilizzate dei formati di file aperti (rif. Licenze aperte e formati di file).</p>
<h2 id=""><img src="../Images/Icons/handson.png" width="150" height="150"></h2>
<h5 id="2-tenete-traccia-di-tutto"><strong>2. Tenete traccia di tutto</strong></h5>
<h6 id="registrazione">Registrazione</h6>
<p>Pre-registrate le informazioni importanti sulla pianificazione e l&#x2019;analisi dello studio in modo da aumentare il livello di trasparenza e contrastare errori di pubblicazione dei risultati negativi. Alcuni strumenti aperti che vi possono aiutare in questa prima registrazione includono <a href="https://aspredicted.org/" target="_blank">AsPredicted</a>, <a href="https://osf.io/" target="_blank">Open Science Framework</a> e <a href="https://cos.io/rr/" target="_blank">Registered Reports</a>. Per la sperimentazione clinica si dovrebbe usare <a href="https://clinicaltrials.gov/" target="_blank">Clinicaltrials.gov</a>. </p>
<h6 id="controllo-versioni">Controllo versioni</h6>
<p>Tenete traccia delle modifiche apportate ai vostri file e in particolar modo al vostro codice analitico utilizzando strumenti di controllo versione (rif. Software di ricerca aperti e codice aperto).</p>
<h6 id="documentazione">Documentazione</h6>
<p>Documentate tutto ci&#xF2; che fate manualmente in un file README. Create un dizionario dati (o altrimenti detto codebook) per descrivere informazioni importanti sui vostri dati. Per un&#x2019;introduzione facile usate <a href="http://kbroman.org/dataorg/pages/dictionary.html" target="_blank">Karl Broman&#x2019;s Data Organization module</a> e fate riferimento alla gestione dei dati. </p>
<h6 id="il-paradigma-della-programmazione-alfabetizzata">Il paradigma della programmazione alfabetizzata</h6>
<p>Valutate la possibilit&#xE0; di utilizzare <a href="http://jupyter.org/" target="_blank">Jupyter Notebooks</a>, <a href="https://yihui.name/knitr/" target="_blank">KnitR</a>, <a href="https://support.rstudio.com/hc/en-us/articles/200552056-Using-Sweave-and-knitr" target="_blank">Sweave</a> o altri strumenti di programmazione &#x201C;alfabetizzata&#x201D; per integrare il vostro codice nella vostra narrativa e documentazione. </p>
<h2 id=""><img src="../Images/Icons/open_licenses.png" width="150" height="150"></h2>
<h5 id="3-condividete-e-applicate-una-licenza-alla-vostra-ricerca"><strong>3. Condividete e applicate una licenza alla vostra ricerca</strong></h5>
<h6 id="dati">Dati</h6>
<p>Evitate i file supplementari, optate per una licenza permissiva plausibile e condividete i vostri dati utilizzando un archivio. Seguite le buone prassi come descritto nel capitolo &quot;Dati e materiali di ricerca aperti&quot;.</p>
<h6 id="materiali">Materiali</h6>
<p>Condividete il vostro materiale perch&#xE8; possa essere ri-utilizzato. Depositate i reagenti in archivi come <a href="https://www.addgene.org/" target="_blank">Addgene</a>, <a href="https://bdsc.indiana.edu/" target="_blank">The Bloomington Drosophila Stock Center</a> e <a href="https://www.atcc.org/" target="_blank">ATCC</a> al fine di renderli facilmente accessibili agli altri ricercatori. Maggiori informazioni sono disponibili al paragrafo <a href="https://github.com/Open-Science-Training-Handbook/Open-Science-Training-Handbook_IT/blob/master/02OpenScienceBasics/02OpenResearchDataAndMaterials.md" target="_blank">Dati e materiali di ricerca aperti</a>.</p>
<h6 id="software-notebook-e-contenitori">Software, notebook e contenitori</h6>
<p>Applicate una licenza al codice per fornire indicazioni su come pu&#xF2; essere (ri)utilizzato. Condividete i notebook con servizi come <a href="http://mybinder.org" target="_blank">mybinder</a> che consentono la visibilit&#xE0; pubblica e l&apos;esecuzione del notebook integrale su risorse condivise. Condividete contenitori o notebook con servizi come <a href="https://arxiv.org/abs/1710.03675" target="_blank">Rocker</a> o <a href="https://codeocean.com/" target="_blank">Code Ocean</a>. Seguite le buone prassi descritte in Software e codice della ricerca aperto.</p>
<h2 id=""><img src="../Images/Icons/open_scholarship.png" width="150" height="150"></h2>
<h5 id="4-presentate-i-risultati-della-vostra-ricerca-in-modo-trasparente"><strong>4. Presentate i risultati della vostra ricerca in modo trasparente</strong></h5>
<p>Segnalate e pubblicate i vostri metodi e interventi in modo esplicito, trasparente e completo per consentirne la riproduzione. Le linee guida di <a href="http://www.equator-network.org/" target="_blank">Equator Network</a>, strumenti come <a href="https://www.protocols.io/" target="_blank">Protocols.io</a> o processi come <a href="https://cos.io/rr/" target="_blank">Registered Reports</a> possono aiutarvi a documentare ai fini della riproducibilit&#xE0;. Ricordatevi di pubblicare i risultati sulla piattaforma di registrazione pubblica come <a href="https://www.socialscienceregistry.org/" target="_blank">ClinicalTrials.gov</a> o <a href="https://www.socialscienceregistry.org/" target="_blank">SocialScienceRegistry</a> entro un anno dalla conclusione dello studio, indipendentemente dalla natura o dal corso dei risultati.</p>
<h2 id=""><img src="../Images/Icons/questions.png" width="150" height="150"></h2>
<h3 id="domande-intoppi-e-comuni-equivoci">Domande, intoppi e comuni equivoci</h3>
<p>Domanda: &#x201C;Tutto quello che serve &#xE8; scritto nell&#x2019;articolo; chiunque pu&#xF2; riprodurre la ricerca. Basta che si leggano quello!&#x201D;</p>
<p>Risposta: Questo &#xE8; uno dei luoghi comuni pi&#xF9; comuni. Perfino quando metodi e flussi di lavoro utilizzati per raggiungere il risultato finale sono stati descritti in maniera estremamente dettagliata non sempre questo &#xE8; sufficiente -nella maggior parte dei casi- perch&#xE9; venga riprodotto. Ci&#xF2; pu&#xF2; essere dovuto a diversi aspetti incluso ambienti computazionali diversi, differenze nelle versioni del software, errori impliciti non chiaramente indicati, ecc.</p>
<p>Domanda: &#x201C;Non ho il tempo per imparare e per stabilire un flusso di lavoro riproducibile&#x201D;</p>
<p>Risposta: In aggiunta ad un numero significativo di servizi online liberamente disponibili che possono essere combinati e che facilitano l&#x2019;impostazione di un intero flusso di lavoro, il dispendio di tempo e lavoro impiegati per metterli insieme contribuir&#xE0; a migliorare sia la validit&#xE0; scientifica dei risultati finali sia a ridurre al minimo il tempo di ri-esecuzione o ad estenderlo negli studi successivi. </p>
<p>Domanda: &#x201C;Le terminologie che descrivono la riproducibilit&#xE0; sono laboriose.</p>
<p>Risposta: Si veda Barba (2018) per una discussione sulla terminologia che descrive la riproducibilit&#xE0; e la replicabilit&#xE0;. </p>
<h2 id=""><img src="../Images/Icons/output.png" width="150" height="150"></h2>
<h3 id="risultati-di-apprendimento">Risultati di apprendimento</h3>
<ol>
<li><p>Comprendere la necessit&#xE0; della riproducibilit&#xE0; della ricerca e le sue argomentazioni.</p>
</li>
<li><p>Essere in grado di stabilire un flusso di lavoro riproducibile all&#x2019;interno di un contesto di un esercizio-modello.</p>
</li>
<li><p>Conoscere gli strumenti che possono supportare la riproducibilit&#xE0; della ricerca.</p>
</li>
</ol>
<h2 id=""><img src="../Images/Icons/magnifying_glass.png" width="150" height="150"></h2>
<h3 id="letture-integrative">Letture integrative</h3>
<ul>
<li><p>Button et al. (2013). Power failure: why small sample size undermines the reliability of neuroscience. <a href="https://doi.org/10.1038/nrn3475" target="_blank">doi.org/10.1038/nrn3475</a></p>
</li>
<li><p>Karl Broman (n.y.). Data Organization. Choose good names for things. <a href="http://kbroman.org/dataorg/pages/names.html" target="_blank">kbroman.org</a></p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03OpenResearchSoftwareAndOpenSource.html" class="navigation navigation-prev " aria-label="Previous page: Software aperto per la ricerca e open source">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05OpenAccessToPublishedResearchResults.html" class="navigation navigation-next " aria-label="Next page: Accesso aperto ai risultati della ricerca pubblicati">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"La riproducibilità della ricerca e l'analisi dei dati","level":"1.3.4","depth":2,"next":{"title":"Accesso aperto ai risultati della ricerca pubblicati","level":"1.3.5","depth":2,"path":"02OpenScienceBasics/05OpenAccessToPublishedResearchResults.md","ref":"02OpenScienceBasics/05OpenAccessToPublishedResearchResults.md","articles":[]},"previous":{"title":"Software aperto per la ricerca e open source","level":"1.3.3","depth":2,"path":"02OpenScienceBasics/03OpenResearchSoftwareAndOpenSource.md","ref":"02OpenScienceBasics/03OpenResearchSoftwareAndOpenSource.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["ga"],"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-43664610-1"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"02OpenScienceBasics/04ReproducibleResearchAndDataAnalysis.md","mtime":"2019-10-29T14:36:26.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-06-14T13:47:51.515Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

